Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_498-Tantra_of_the_Blue-Clad_Vajrapani-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དཔལ་ཕྱག་ན་རྡོ་རྗེ་གོས་སྔོན་པོ་ཅན་ལ་ཕྱག་འཚལ་ལོ། །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་དུ་བཞུགས་པ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: I prostrate to the Blue-Clad Blessed Vajrapāṇi! I prostrate to the buddhas and bodhisattvas of the three times!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཅོམ་ལྡན་འདས་མི་བསྐྱོད་པ་རྡོ་རྗེའི་རིགས་ཀྱི་སངས་རྒྱས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་ན་རྡོ་རྗེ་དང་། རྡོ་རྗེ་སྡེ་དང་། རྡོ་རྗེ་ཀུན་ཏུ་འཛིན་པ་དང་། །རྡོ་རྗེ་རབ་ཏུ་འདུལ་བྱེད་དང་། །རྡོ་རྗེ་མི་བཟད་འཇོམས་དང་། རྡོ་རྗེ་གདུག་པ་ཀུན་འདུལ་དང་། རྡོ་རྗེ་དབྱིངས་ལས་རྒྱལ་བ་དང་། རྡོ་རྗེ་དགྱེས་གནས་སྐྱོབ་ལ་སོགས་པའི་འཁོར་བྱེ་བ་ཕྲག་སྙེད་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: Blessed Akṣobhya, the buddha of the vajra family, was residing in the palace in Alakāvatī together with a retinue of millions of bodhisattvas, including Vajrapāṇi, Vajra Regiment, Constant Vajra Holder, Vajra Tamer, Terrible Vajra Conqueror, Vajra Tamer of All Evil, Vajra Victor of Basic Space, Vajra Joyfully Abiding Protector, and others.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ཉིད་ཀྱིས་རྡོ་རྗེ་ཐུགས་ཀར་ལན་གསུམ་གསོར་ཏེ།
en: At that time, the great being, the bodhisattva Vajrapāṇi himself, brandished a vajra three times at his heart center.

source: བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་ལན་གསུམ་བྱས་ནས་ཕྱག་འཚལ་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He made three circumambulations of the Blessed One and prostrated himself. Then, kneeling on his right knee, Vajrapāṇi requested,

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་འཛིན་པ་ཆེན་པོ་འབྱུང་པོ་ཀུན་འདུལ་བར་བྱེད་ཅིང་། ས་འོག་གི་གདུག་པ་ཅན་འདུལ་བར་བྱེད་པའི་རྡོ་རྗེ་ཀུན་འདུལ་ཞེས་བྱ་བའི་རྒྱུད་ཆེན་པོ་བཤད་དུ་གསོལ།
en: “Blessed One, Thus-Gone One, Great Vajra Holder, please explain the great tantra called The All-Subjugating Vajra that subjugates all bhūtas and that tames the evil ones that dwell beneath the earth.

source: རྡོ་རྗེ་འཛིན་པ་ཆེན་པོ་བཤད་དུ་གསོལ་ཁྱབ་བདག་ཆེན་པོ་བཤད་དུ་གསོལ། གདུག་པ་ཀུན་འདུལ་བར་བྱེད་པ་ཆེན་པོས་བཤད་དུ་གསོལ། མུན་པ་ཀུན་འཇོམས་པ་ཆེན་པོ་བཤད་དུ་གསོལ་ཞེས་
en: Great Vajra Holder, I supplicate you to teach! Great Lord of All, I supplicate you to teach! Great Tamer of All Evil Forces, I supplicate you to teach! Great Dispeller of All Darkness, I supplicate you to teach!”

source: ཕྱག་ན་རྡོ་རྗེས་གསོལ་བ་བཏབ་བོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ།
en: At this request from Vajrapāṇi, the Blessed One declared,

source: རྡོ་རྗེ་འཆང་ཆེན་པོ་གསང་བ་པ་ཁྱོད་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་རྡོ་རྗེ་ཀུན་འདུལ་ཞེས་བྱ་བའི་རྒྱུ་དང་ལ་ཞུ་བ་ལེགས་སོ།
en: “It is excellent that you, Great Vajradhara, Secret One, have, for the benefit of sentient beings, requested from me the tantra called The All-Subjugating Vajra.

source: །གསང་བ་པའི་བདག་པོ་ལེགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལེགས་སོ།
en: Lord of Secrets, that is excellent! Great Bodhisattva, that is excellent!

source: །དེའི་ཕྱིར་ལག་ན་རྡོ་རྗེའི་རིགས་རྣམས་ཁྱེད་རྗེས་སུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག
en: Thus, you who share Vajrapāṇi’s lineage, listen and remember this!

source: །ངས་རྣམ་པར་ཕྱེ་སྟེ་རྡོ་རྗེ་ས་འོག་འབྱུང་པོ་འདུལ་བ་རྡོ་རྗེ་ཞེས་བྱ་བའི་རྒྱུད་བཤད་ཀྱིས་རྗེས་སུ་ཟུང་ཤིག
en: I will reveal and explain the tantra called The Vajra that Subjugates the Evil Forces Below the Vajra Earth. Receive it!”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After pronouncing these words,

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྡོ་རྗེ་ཀུན་འདུལ་གྱི་ཏིང་ངེ་འཛིན་གྱིས་
en: the Blessed One, by means of the absorption of the all-subjugating vajra,

source: ས་འོག་གི་གདོན་དང་། འབྱུང་པོ་ཀུན་འཇོམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: entered equipoise in the absorption called vanquishing all grahas and bhūtas from below the earth.

source: །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཁྲོ་བོ་གདུག་པ་ཀུན་འདུལ་བར་བྱེད་པ་དུ་མ་སྤྲོས་ཏེ།
en: No sooner had the Blessed One entered equipoise than a multitude of wrathful subjugators of evil forces emanated from all the pores of his body and

source: ས་འོག་ས་སྟེངས་ས་བླ་གསུམ་གང་བར་མཛད་དེ།
en: filled the space under the earth, on the earth, and above the earth.

source: ས་འོག་གི་ཀླུ་རྣམས་ཀྱི་གནས་རྣམས་གདུག་པའི་ཧཱུཾ་སྒྲས་ཀུན་ཏུ་གང་བར་བྱས་ནས་
en: The entire land of the underground nāgas was filled with the horrible sound hūṃ.

source: ཀླུའི་རྒྱལ་པོ་བརྒྱད་པོ་འཁོར་དང་བཅས་པ་བཏུལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཀུག་གོ།
en: The eight nāga kings together with their retinues were tamed, and bowed before the Blessed One.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་མཐའ་ཡས་གདུག་པའི་སེམས་ལངས་ཏེ་དབུགས་ཤིན་ཏུ་ཚ་བར་གཏོང་བར་སེམས་པ་
en: But the nāga king Anantaka then gave rise to an evil thought, intending to release a scalding breath.

source: དེ་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་ཏེ། གསང་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལག་ན་རྡོ་རྗེ་ལ་བྱིན་གྱིས་བརླབས་ནས་
en: But the Blessed One knew his intention and blessed the Lord of Secrets, Vajrapāṇi,

source: ཀླུ་ཐམས་ཅད་ཀྱི་ཞེ་སྡང་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་སྔགས་འདི་གསུངས་སོ། །ཨོཾ་ནཱི་ལ་བཛྲ་ཀྲོ་དྷ་ནཱ་ག་ཧཱུྃ་ཕཊ་ཅེས་བཟླས་སོ།
en: who spoke this mantra called the mantra that completely pacifies the anger of all nāgas: “Oṃ nīlavajra krodhanāga hūṃ phaṭ.”

source: །དེ་ནས་ཀླུ་མཐའ་ཡས་སེམས་རབ་ཏུ་ཞི་སྟེ་བྱང་ཆུབ་སེམས་དང་ལྡན་པར་གྱུར་པས་ཀླུ་ཐམས་ཅད་སེམས་རབ་ཏུ་ཞིའོ།
en: Now the mind of the nāga Anantaka was completely pacified; he became endowed with the awakened mind, through which the minds of all the nāgas were completely pacified.

source: །དེ་ནས་མཐའ་ཡས་ལ་སོགས་པའི་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ས་འོག་ན་བཞུགས་པ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པ་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then all of the nāga kings like Anantaka, who live below the earth, supplicated the Blessed One, the Great Vajra Holder, with these words:

source: །བཅོམ་ལྡན་འདས་ཕྱི་མའི་དུས་ན་སླད་མའི་ཚེ་སེམས་ཅན་རྣམས་ལ་ས་འོག་གི་གདོན་རྣམས་ཀྱིས་བར་དུ་མི་གཅོད་ཅིང་དེ་དག་གི་གདུག་པ་ཞི་བར་བྱེད་པའི་ཆོ་ག་བཤད་དུ་གསོལ།
en: “Blessed One, we supplicate you to explain a ritual that will, in future times and onward, prevent the grahas that are living below the earth from making obstacles for sentient beings, and that will also pacify the evil of those spirits.

source: བདག་ཅག་ཀླུའི་རྒྱལ་པོ་རྣམས་དང་བདག་ཅག་གི་འཁོར་རྣམས་ཀྱིས་སེམས་ཅན་ཆེན་པོ་དེ་ལ་བར་དུ་གཅད་པར་མི་ནུས་པ་བཤད་དུ་གསོལ།
en: We supplicate you to explain why we, the nāga kings and our retinues, are unable to create obstacles for that great being.

source: བདག་ཅག་ཀླུའི་རྒྱལ་པོ་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བ་བཤད་དུ་གསོལ་ཞེས་གསོལ་བ་བཏབ་བོ།
en: We supplicate you to explain to us, the nāga kings, our purpose.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པ་ཆེན་པོས་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་རྣམས་ལ་ཅུང་ཟད་སྤྱན་གྱིས་གཟིགས་ནས་བཀའ་སྩལ་པ།
en: The Blessed One, the Great Vajra Holder, glanced at the nāga kings and replied,

source: ཀླུའི་རྒྱལ་པོ་དག་ལེགས་སོ། །ཞུ་བའི་དུས་ལ་བབ་བོ། །ངས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་རབ་ཏུ་ཕྱེ་སྟེ་བཤད་ཀྱིས་ཉོན་ཅིག
en: “Nāga kings, that is excellent! Your request is timely. I will reveal this for the benefit of sentient beings. I will explain; listen!”

source: །བཅོམ་ལྡན་འདས་ལེགས་སོ། །ཞེས་གསོལ་ཏེ་ཀླུ་ལ་སོགས་པ་རྣམས་ལྟར་ཉན་ཏོ།
en: The nāgas and the others replied, “Excellent, Blessed One!” They then listened appropriately.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་འདུལ་བ་ཞེས་བྱ་བའི་ལེའུ་འདི་བཤད་དེ།
en: At that point, the Blessed One explained the following chapter called “Taming the Nāgas.”

source: ཧཱུྃ། སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར།
en: Hūṃ! For the benefit of all sentient beings,

source: །རྡོ་རྗེ་འཛིན་ཆེན་སྟོན་པ་དེས། །ཉིད་ཀྱི་འཁོར་ལ་རབ་གཟིགས་ཏེ།
en: The Teacher, the Great Vajra Holder, Carefully observed his own retinue,

source: །འོད་ཟེར་ཀུན་ཏུ་རབ་བཀྱེ་ནས། །གདོན་རྣམས་རླག་བྱེད་ཐབས་གསུངས་པ།
en: Projected light into all directions, And then taught the method for destroying all grahas:

source: །དཀར་པོའི་ཕྱོགས་ཀྱི་ཚེས་བརྒྱད་དང་། །དེ་བཞིན་བཅུ་བཞི་བཅྭ་ལྔ་ལ། །རབ་ཏུ་དབེན་པའི་ས་ཕྱོགས་སུ།
en: “On the eighth day of the waxing moon, Or likewise on the fourteenth and fifteenth days, In an extremely isolated place,

source: །ཕྱག་ན་རྡོ་རྗེ་རབ་ཁྲོས་པ། །གཞོན་ཚུལ་འགྱིད་བ་རབ་བསམས་ལ།
en: Contemplate wrathful Vajrapāṇi, Youthful and with majestic poise.

source: །རིན་ཆེན་སྣོད་དམ་ཁམ་ཕོར་དུ། །གསེར་ལ་སོགས་པའི་རིན་ཆེན་བདུན། །དག་པར་བསྒྲུབས་ཏེ་རབ་བཅུག་ནས།
en: “Next, purify gold and so forth, the seven precious things, And place these in a jeweled vessel or clay pot.

source: །གསང་སྔགས་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ།
en: Recite 108 mantras.

source: །དཀོན་མཆོག་གསུམ་གྱི་བཀའ་བདེན་པས། །འབྱུང་པོ་དེ་ལ་གཏོར་བྱིན་ཏེ།
en: “Resorting to the true utterance of the Three Jewels, Give an oblation to the bhūtas.

source: །གང་གནས་བརྟན་སར་རབ་སྦས་ལ། །འབྱུང་པོ་ཀླུ་གདུག་ཞི་བར་འགྱུར།
en: Bury it in firm ground wherever they abide, And the bhūtas and evil nāgas will be pacified.

source: །གང་ཚེ་ཞི་བས་མ་ཕན་ན། །དེ་ཚེ་གདུག་པའི་མཚོན་ཆ་རྣམས། །རང་གི་ཁང་པར་རབ་ཏུ་འབར།
en: “When these peaceful methods are not sufficient, With terrible weapons Set their homes ablaze.

source: །སྡུག་བསྔལ་མི་བཟད་དྲག་པོ་སྟེ། །དེ་ཚེ་སྔོན་གྱི་སེམས་དྲན་པས། །ཞི་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །
en: “This fierce, unbearable suffering Will remind them of their previous intentions, And they will undoubtedly be pacified.”

source: དེ་ནས་འདིར་བཅོམ་ལྡན་འདས་ཀྱིས་ལས་ཀྱི་ལྷའི་ཆོ་ག་རབ་ཏུ་གསུངས་པ།
en: Then the Blessed One explained the ritual for the action deity:

source: རྟག་ཏུ་བྱང་ཆུབ་སེམས་ཐོབ་ཅིང་། །དམ་ཚིག་སྡོམ་པ་ཀུན་ལྡན་པ། །ཁྲུས་ཀྱི་ལས་རྣམས་ཀུན་བྱ་སྟེ། །
en: “Always in possession of the awakened mind, And endowed with all commitments and vows, Engage in all of the acts of bathing.

source: རྣམ་པར་དག་པའི་ས་གཞི་ལ། །དཀྱིལ་འཁོར་ཇི་ལྟར་མཛེས་པར་བྱ། །
en: “In a clean and pure place, Beautify the maṇḍala as is fitting.

source: ཧཱུྃ་ཡིག་ལས་བྱུང་ལྕགས་ཀྱུ་ཡིས། །སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །སྐད་ཅིག་མདུན་བསམས་མཆོད་སོགས་བྱ། །
en: Visualize an iron hook that emerges from the syllable hūṃ, Bringing the buddhas and bodhisattvas instantaneously before you. Make offerings and so forth to them.

source: ཨོྃཤཱུནྱ་ཏཱ་ཛྙཱ་ན་བཛྲ་སྭ་བྷཱ་བ་ཨཱ་ཏཱ་ཀོ྅ཧྃ། སྟོང་པའི་ཏིང་ངེ་འཛིན་རྣམས་བསྒོམ། །
en: “Oṃ śūnyatā­jñāna­vajra­svabhāvātmako 'haṃ Meditate on the absorption of emptiness.

source: ནམ་མཁའི་ཁམས་སུ་ཨ་དང་ནི། །ཟླ་བ་དང་པོ་ཡི་གེ་ཧཱུྃ། །འོད་ཟེར་ཀུན་དུ་འབར་བར་བསྒོམ། །
en: “In the expanse of space, visualize the letter āḥ, And the first moon, the letter hūṃ Blazing with great light.

source: འགྲོ་དྲུག་ཉོན་མོངས་ཀུན་སྦྱངས་ཏེ། །རྣམ་གྲོལ་ས་ལ་ངེས་བཀོད་ནས། །
en: This purifies the negative emotions of the six classes of beings, Definitively placing them in the state of complete liberation.

source: འོད་བསྡུས་ཧཱུྃ་གི་རྣམ་པར་བསམ། །དེ་ཉིད་རྡོ་རྗེ་རྩེ་ལྔ་ཅན། །
en: “Imagine the light gathered back in the form of hūṃ Marked with a five-pronged vajra.

source: འོད་ཟེར་ཕྲེང་བ་འཕྲོ་བར་བསམ། །དེ་ཡི་འོད་ཀྱིས་སེམས་ཅན་རྣམས། །རྡོ་རྗེའི་ངོ་བོར་ཐིམ་པར་བྱ། །
en: A garland of light shines forth from this, Causing all sentient beings To dissolve into the vajra essence.

source: དེ་ལས་ཁྲོ་བོ་ཆེན་པོའི་སྐུ། །སྐུ་མདོག་སྔོན་པོ་ཆེར་འབར་བ། །
en: “From this the Great Wrathful One Blue in color, blazes forth.

source: སྐུ་མདོག་ནག་པོའི་གཟུགས་ཅན་དེ། །ཞལ་གཅིག་ཕྱག་གཉིས་རྡོ་རྗེ་བསྣམས། །
en: “His form is dark in color, With one face and two hands, holding a vajra.

source: གཡོན་བརྐྱང་ན་ཚོད་བཅུ་དྲུག་འཆང་། །མཐའ་ཡས་ལ་སོགས་བརྒྱད་ཀྱིས་བརྒྱན། །
en: Seated with his left leg extended, he is sixteen years of age. He is adorned with eight ornaments, Anantaka, and so forth.

source: ན་བཟའ་སྔོན་པོའི་ཟེར་འཇོལ་ཅན། །སྤྱན་གསུམ་དམར་མཛེས་གྱེན་དུ་འཇིལ། །
en: His clothing is blue and luminous, His three eyes are beautifully red and looking upward.

source: རལ་བ་གྱེན་བརྫེས་རྡོ་རྗེ་ཡི། །དབུ་རྒྱན་ཅན་དུ་བསམ་པར་བྱའོ། །
en: His dreadlocks stream upward Bound by a vajra ornament—imagine him like this.

source: དེ་ནས་ཡེ་ཤེས་ཁྲོ་བོ་ཆེ། །སྤྱན་དྲངས་ཛཿཧཱུྃ་བྃ་ཧོཿས་གཞུག །
en: “Then great wrathful wisdom Is invoked and ushered in with jaḥ hūṃ vaṃ hoḥ

source: མགོ་དང་ལྐོག་མ་སྙིང་ག་རུ། །ཨོྃ་ཨཱཿཧཱུྃ་གི་རྣམ་པ་ཡི། །ཡི་གེ་བཅུ་གསུམ་སྔགས་ཀྱིས་བརྒྱན། །འཁོར་ལོ་པདྨ་རྡོ་རྗེ་བསམ། །
en: “Visualize, at his head, throat, and heart center, A wheel, a lotus, and a vajra Marked by the syllables oṃ āḥ hūṃ, Ornamented with the thirteen-syllable mantra.

source: མི་བསྐྱོད་རྡོ་རྗེས་དབང་བསྐུར་ཏེ། །ཀུན་འཇོམས་རྣམ་པར་དག་པར་བསམ། །
en: “Visualize that Akṣobhya-Vajra confers empowerment, And all is conquered and perfectly purified.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་རྩ་བའི་སྔགས་ལས་ཐམས་ཅད་པ་གསུངས་པ། ཨོྃ་ནཱི་ལཱྃ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཧཱུྃ་ཧཱུྃ་ཕཊ། རབ་ཏུ་བརྗོད་པར་བྱའོ།
en: Then the Blessed One resolutely spoke his root mantra, the statement of all activity: “Oṃ nīlāmbara­dhara­vajra­pāṇi hūṃ hūṃ phaṭ.

source: །སྔགས་ཀྱི་ཕྲེང་བ་དེ་དག་ཀྱང་། །ཞི་ལ་རབ་དཀར་དབང་ལ་དམར། །རྒྱས་ལ་སེར་པོ་དྲག་ལ་གནག
en: “The garlands of mantra as well Should be white for peaceful, red for magnetizing, Yellow for increasing, and black for wrathful activity.

source: །རྟོག་པ་ཀུན་ཏུ་སྤངས་ཏེ་བཟླས།
en: Completely abandon thoughts and recite this.

source: །སྤྲོ་དང་བསྡུ་བའི་བྱེ་བྲག་གིས། །ཇི་ལྟར་མོས་པའི་བསམ་གཏན་བྱ།
en: “With the distinct techniques of emanating and absorbing, Engage in concentration on whatever you wish for.

source: །མི་མོས་རྣལ་འབྱོར་རབ་ཏུ་སྤང་།
en: Give up the practice of what you do not desire.

source: །དཔལ་རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་ཞི་བའི་ལས་སྒྲུབ་པ་དང་ལྷའི་ལེའུ་སྟེ་དང་པོའོ།།
en: This was the first chapter from The Glorious Tantra of the Vajra in the Underworld, “Accomplishing Peaceful Activity” or the “Chapter of the Gods.”

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the great bodhisattva, the great being Vajrapāṇi, supplicated the Blessed One with these words:

source: །བཅོམ་ལྡན་སྟོན་པ་རྡོ་རྗེ་འཛིན། །བར་ཆད་ཞི་བྱེད་གཏོར་མ་ཡི། །ཆོ་ག་མཆོག་ནི་བཤད་དུ་གསོལ།
en: “Blessed One, Teacher, Vajra Holder, Please explain the supreme ritual For the oblation that pacifies obstacles.

source: །སེམས་ཅན་དོན་དུ་བརྩོན་ལྡན་བགྱི།
en: Make this effort for the benefit of beings!”

source: ལེགས་སོ་རྡོ་རྗེ་འཆང་བ་གཙོ།
en: “Excellent, principal Vajra Holder!

source: །བར་ཆད་ཞི་བའི་ཆོ་ག་དང་། །དངོས་གྲུབ་ཐབས་ཀྱི་ཆོ་ག་ནི། །གཏོར་མ་ཀུན་གྱི་གཏེར་འགྱུར་བཤད།
en: I will explain the basis of all oblations: The ritual for pacifying obstacles, And the ritual that is a method for gaining spiritual accomplishment.

source: །རབ་ཏུ་མཛེས་པའི་སྣོད་མཆོག་ཏུ། །བཟའ་དང་བཅའ་བ་ལ་སོགས་པའི། །ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་བྱ།
en: “In a beautiful vessel, Place many excellent articles Such as food, drink, and so forth.

source: །སྟོང་པའི་ཏིང་ངེ་འཛིན་འགྲོ་བས། །བྲུྃ་ལས་མཛེས་པའི་སྣོད་བསྐྱེད་དེ།
en: “Through entering the absorption of emptiness, From bruṃ generate a beautiful vessel.

source: །ཁྃ་ལས་ཁ་ཟས་ནམ་མཁའི་ཁམས། །མཉམ་པར་བསམས་ཏེ་སྔགས་འདི་བརྗོད། །ཨོྃ་ཨ་ཀཱ་རོ་མུ་ཁྃ་སརྦྦ་དྷརྨྨཱ་ཎཱྃ་ཨཱ་དྱ་ནུ་ཏྤནྣ་ཏྭཱད་ཨོཾ་ཨཱཿཧཱུྃ་ཕཊ་སྭཱ་ཧཱ་
en: With kham visualize food and drink Filling all of space, and recite this mantra: Oṃ āḥkāro mukhaṃ sarva­dharmāṇām ādyanta­panna tathā oṃ āḥ hūṃ phaṭ svāhā.

source: །བདུད་རྩིར་བསམས་ཏེ་རབ་ཏུ་སྤེལ། །སྤེལ་བ་གཉིས་ཀྱིས་རྣམ་པར་སྦྱང་།
en: “Visualizing it as nectar, expand it greatly. Through two expansions, purify it.

source: །ནམ་མཁར་ཧྲཱིཿལས་པདྨ་བརྒྱད། །དཔག་ཏུ་མེད་པ་བསམ་བྱ་སྟེ།
en: In space, from the letter hrīḥ Visualize eight lotuses, immeasurably large.

source: །གཙོ་བོ་མགོན་པོ་རྣམ་ཐོས་བུ། །གནོད་སྦྱིན་བྱེ་ཚོགས་ཀྱིས་བསྐོར་ཅིང་། །ཀླུ་བརྒྱད་ཀྱིས་མཆོད་སྤྱན་དྲང་བྱ།
en: “Then invite the protector Vaiśravaṇa, The central figure surrounded by a retinue of ten million yakṣas, The recipient of the offerings of the eight nāga kings.

source: །གནོད་སྦྱིན་རྒྱལ་པོ་དེ་དག་ལ། །རྨུགས་འཛིན་གང་བ་བཟང་པོ་དང་། །ནོར་བཟངས་ཀུ་བེ་ར་དང་ནི། །ཡང་དག་འབྲོག་གནས་ལྔས་རྩེན་དང་། །པི་ཙི་ཀུཎྜ་ལི་རྣམས་ནི།
en: “Imagine that the yakṣa kings— Jambhala and Pūrṇabhadra, Maṇibhadra, Kubera, Samprajñāna, Guhyasthāna, Pāñcika, And Bījakuṇḍalī—

source: །འཁོར་གྱི་ཚུལ་གྱིས་གཙོ་ལ་བསྐོར། །ཕྱོགས་དང་མཚམས་སུ་བསམ་པར་བྱ།
en: Gather round the central figure like a retinue In all the main and intermediate directions.

source: །བྱེ་བའི་འཁོར་ཚོགས་ཐུན་མོང་ཡིན། །ཀླུ་བརྒྱད་གནོད་སྦྱིན་ཕྱི་ནའོ།
en: “The common retinue of ten million Are behind the eight nāgas and yakṣas.

source: །དེ་ནས་ལྕགས་ཀྱུས་སྤྱན་དྲངས་ལ། །མ་བྲལ་གཙོ་དང་ལྕགས་ཀྱུའོ།
en: Next, for the invitation, use hooks That are conjoined from the central deity.

source: །བཞོན་པ་སེང་གེ་རྟ་ཡི་ཚོགས། །ཀུན་ཀྱང་ཞལ་གཅིག་ཕྱག་གཉིས་པ།
en: “Imagine them on mounts of lions and horses, All with one face and two hands,

source: །རིན་ཆེན་འབར་བའི་རྒྱལ་མཚན་དང་། །ནོར་བུ་རིན་ཆེན་བུམ་པ་དང་།
en: With victory banners, blazing with gems And the vase of precious jewels.

source: །རིན་ཆེན་འབར་བ་རལ་གྲི་དང་། །གྲི་མདུང་ཁང་བརྩེགས་རལ་གྲི་ཕུབ། །མཚོན་ཆ་སྣ་ཚོགས་འཕྱར་བར་བསྒོམ།
en: “They hold swords blazing with gems, Daggers and spears, celestial chariots, swords, and shields, And various weaponry raised on high; visualize them thus.

source: །སྤྱན་འདྲེན་ཚེ་ན་རྔ་སོགས་དང་། །དུང་ཆེན་འབྲས་སྤོས་དག་ནི་དབུལ།
en: “At the time of invitation, offer drum And trumpet music, fruits and incense.

source: ཨོྃ་བཻ་བ་ཤྲ་བ་ཎ་ས་པ་རི་བཱ་ར་ས་མཱ་ཛཿཛཿཧཱུྃ་བྃ་ཧོཿ། ཨོྃ་བཻ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎ་ཨཱ་ཀཪྵ་ཡ་ཧཱུྃ་ཛཿ། ཞེས་སྤྱན་དྲང་བའི་སྔགས་སོ།
en: “Oṃ vaiśravaṇa saparivāra samāja jaḥ hūṃ vaṃ hoḥ Oṃ ve svāhā Oṃ vaiśravaṇa ākarṣaya hūṃ jaḥ Is the mantra for the invitation.

source: །ཨོྃྃ་ཨ་མྲྀ་ཏ་ཀུཎྜ་ལི་ཧ་ན་ཧ་ན་ཧཱུྃ་ཕཊ། ཅེས་པ་ནི་བགེགས་བསྐྲད་པའི་སྔགས་སོ།
en: “Oṃ amṛta­kuṇḍalī hana hana hūṃ phaṭ Is the mantra for dispelling obstructors.

source: །དེ་ནས་མེ་ཏོག་ལ་སོགས་པས། །མཆོད་པ་དག་ནི་ནམ་མཁའ་རུ། །རབ་ཏུ་མཆོད་དེ་སྤྲོ་བར་བྱ།
en: “Then with flowers and so forth, Make pure offerings in the sky, Offering them with joy.

source: །ཨོྃ་ནཱི་ལཱྃ་པ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཨཱ་ཛྙཱ་པ་ཡ་ཏི་ཨི་མྃ་བ་ལི་གྲྀཧྞ་ཏུ། ས་མ་ཡ་རཀྵ་ནྡུ། མ་མ་སརྦྦ་སིདྡྷི་མྨེ་པྲ་ཡཙྪནྟུ་མ་མ་ཀརྨྨཱ་མོ་གྷ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཛམ་བྷ་ལཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་པཱུརྞ་བྷ་དྲཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་མ་ཎི་བྷ་དྲཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཀུ་བཻ་རཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་སྃ་པྲ་ཛྙཱ་ནཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་གུ་ཧྱ་སྠཱ་ནཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་པཱཉྩི་ཀཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཙི་པི་ཀུཎྜ་ལི་ནེ་སྭཱ་ཧཱ། གཏོར་མ་དབུལ་བའི་སྔགས་སོ།
en: “Oṃ nīlāmbara­dhara­vajra­pāṇi ājñāpayati imaṃ baligṛhnantu Samayarakṣantu Mama sarva­siddhiṃ me prayacchantu mama karmāmogha svāhā Oṃ vaiśravaṇāyā svāhā Oṃ jambhalāya svāhā Oṃ pūrṇavhadrāya svāhā Oṃ maṇibhadrāya svāhā Oṃ kuberāya svāhā Oṃ samprajñānāya svāhā Oṃ guhyasthānāya svāhā Oṃ pāñcikāya svāhā Oṃ bījakuṇḍaline svāhā These are the mantras for offering the oblation.

source: །དེ་ནས་མཆོད་དེ་མགྲོན་རྣམས་བཏང་།
en: “Then make that offering to the guests.

source: །འོད་ཟེར་ལྕགས་ཀྱུ་བཀྲོལ་ནས་སུ། །བཀྲོལ་བའི་དུས་ན་གཤེགས་དང་མཉམ།
en: Hooks of light rays shine forth, And immediately they arrive.

source: །མཉམ་ལངས་སྤྱོད་པའི་ཆོ་ག་བྱའོ།
en: Perform the ritual of equal enjoyment.”

source: །རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་གཏོར་མའི་ལེའུ་སྟེ་གཉིས་པའོ།།
en: This was the second chapter of The Tantra of the Vajra in the Underworld, “The Oblation.”

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་དངོས་གྲུབ་བསྒྲུབ་པར་འདོད་པའི་དོན་དུ་
en: Then, for the benefit of those who wish to attain worldly accomplishment, the Blessed One

source: འཇིག་རྟེན་པའི་འཁོར་ལོ་ཀུན་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་སྐུའི་བ་སྤུ་ནས་འོད་ཟེར་སྤྲོས་ཏེ།
en: entered the absorption called the origination of all worldly wheels and emanated rays of light from the pores of his body.

source: རྣམ་ཐོས་སྲས་འཁོར་བཅས་ཀྱི་ཐུགས་བསྐུལ་ནས་འཁོར་དེར་འདུས་ཏེ།
en: Vaiśravaṇa and his retinue were thus inspired and gathered around him.

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་རིན་པོ་ཆེའི་ཕྱེ་མས་གཏོར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He prostrated to the Blessed One, scattered dust made from precious gems, and made this request:

source: །བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་སྐྱོང་བའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་ཞེས་བགྱི་བ་ལགས་ཏེ།
en: “Blessed One, I am the Dharma-upholding king named Vaiśravaṇa.

source: བདག་གིས་ཆོས་དང་ལྡན་པ་རྣམས་ཀྱི་ཆོས་བསྲུང་ཞིང་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་བདག་ཉིད་ཀྱིས་གསང་བ་བཤད་ན་
en: If I myself were to proclaim a secret in order to protect the Dharma of the pious and ensure that the Dharma abides for a long time,

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་དབྱེ་བར་ཅི་གནང་ཞེས་གསོལ་ཏོ།
en: would the Blessed One grant me an opportunity?”

source: རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ། །རང་གི་གསང་བ་ལེགས་པར་ཤོད་ཅིག །ངས་ཀྱང་རྗེས་སུ་ཡི་རང་ཞིང་བྱིན་གྱིས་བརླབ་པར་བྱའོ།
en: “Great King, excellent! Explain your secret well! I rejoice and give my blessings.

source: །རྡོ་རྗེ་འཆང་བ་ཀུན་གྱིས་ཀྱང་བྱིན་གྱིས་རློབ་པར་འགྱུར་གྱིས་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲོས་ཤིག་ཅེས་བཀའ་སྩལ་ཏོ།
en: May all vajra holders also bless you. Speak well!”

source: །དེ་ནས་རྣམ་ཐོས་ཀྱི་བུ་རང་གི་སྟན་ལས་ལངས་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་རང་གི་རིག་པ་འདི་སྨྲས་སོ།
en: Then Vaiśravaṇa got up from his seat, prostrated to the Blessed One, and spoke his own incantation:

source: །ཨོྃ་བཻ་ཤྲ་བ་ཎཱ་ཡ་ཧཱུྃ་ཧཱུྃ། པ་ཙ་པ་ཙ། ཙྪིནྡ་ཙྪིནྡ་སྭཱ་ཧཱ།
en: “Oṃ vaiśravaṇāya hūṃ hūṃ paca paca chinda chinda svāhā. ”

source: །བཅོམ་ལྡན་འདས་བདག་གི་སྔགས་འདིའི་སྒྲུབ་པ་ནི་འདི་ལགས་ཏེ།
en: “O Blessed One, the accomplishment of this, my mantra, is excellent.

source: གང་ཞིག་བདག་སྒྲུབ་པར་འདོད་པ་དེས་དུས་གསུམ་དུ་མཆོད་པ་རྒྱ་ཆེན་པོ་བཤམས་ཏེ།
en: Whoever wants to accomplish my state of being should arrange great offerings in the three times.

source: བདག་འཁོར་དང་བཅས་པ་མཆོད་ལ་སེམས་རྩེ་གཅིག་དང་ལྡན་པས་གནས་དབེན་པར་འདུག་སྟེ།
en: To make the offering to me and my retinue, the practitioner should remain with one-pointed concentration in an isolated place.

source: བཅོམ་ལྡན་འདས་ཕྱག་ན་རྡོ་རྗེ་སྒོམ་པ་པོས་བདག་གི་སྔགས་དེ་ཁྲི་ཕྲག་གཅིག་བཟླས།
en: A practitioner of the blessed Vajrapāṇi must recite my mantra ten thousand times,

source: དེ་ནས་ལས་རྣམས་བསྒྲུབ་པར་བྱའོ།
en: and then accomplish the activities.

source: །དེ་ལྟར་བདག་སྒྲུབ་པ་དང་བདག་གི་ལས་སྒྲུབ་པ་པོ་དེས་བདག་འཁོར་དང་བཅས་པ་ལ་གཏོར་མ་དང་མཆོད་པ་རྒྱ་ཆེན་པོས་མཆོད་པར་བྱའོ།
en: One who thus accomplishes my state of being and my activity should offer an oblation and make vast offerings to me and to my retinue.

source: །དེ་ལ་བདག་དང་བདག་གི་འཁོར་རྣམས་ལ་མཆོད་པ་དང་གཏོར་མ་རྒྱ་ཆེན་པོ་དབུལ་བའི་སྔགས་ནི་འདི་རྣམས་ཡིན་ཏེ།
en: The mantra to recite for making vast offerings and offering the oblation to me and my retinue is this:

source: ཨོྃ་བཻ་ཤྲ་བ་ཎཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཛམ་དྷ་ལཱ་ཡ་སྭཱ་ཧཱ ཨོྃ་པཱུརྞ་བྷ་དྲཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་མ་ཎི་པྷ་དྲཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཀུ་བེ་རཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་སྃ་པྲ་ཛྣཱ་ནཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་གུ་ཧྱ་སྠཱ་ནཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་པཱཉྩི་ཀཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་པི་ཙི་ཀུཎྜ་ལི་ནེ་སྭཱ་ཧཱ་
en: “Oṃ vaiśravaṇāya svāhā Oṃ jambhalāya svāhā Oṃ pūrṇabhadrāya svāhā Oṃ maṇibhadrāya svāhā Oṃ kuberāya svāhā Oṃ samprajñānāya svāhā Oṃ guhyasthānāya svāhā Oṃ pāñcikāya svāhā Oṃ bījakuṇḍaline svāhā

source: ཞེས་པའི་སྔགས་དེ་རྣམས་ནི་བདག་གི་འཁོར་དང་བཅས་པ་ལ་མཆོད་པ་དང་གཏོར་མ་སྦྱིན་པའི་སྔགས་གཉིས་སུ་ཤེས་པར་བྱའོ།
en: “Know that these are the mantras both for making offerings and giving an oblation to me and my retinue.

source: །དེ་ནས་བདག་གི་ལས་སྒྲུབ་པ་ནི་བདག་གིས་བཤད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ་ཞེས་གསོལ་ནས་
en: “Then, with respect to accomplishing my activity, I requested the Blessed One to bless me with his explanation.

source: འདིའི་ལས་བཤད་པ་ནི།
en: The explanation of the activity is this:

source: གང་ཟག་གང་གིས་སྒྲུབ་འདོད་པས། །གསང་དང་སྦྱིན་སྲེག་མནན་པ་གསུམ། །རིམ་པ་ཇི་བཞིན་ཤེས་པར་བྱ།
en: “Whoever wishes to gain accomplishment Must know the stages Of killing, the burnt offering, and the suppression ritual.

source: །བསྒྲུབ་བྱ་བསྟན་ལ་སྡང་བ་རྣམས། །སྤྲ་ཚིལ་ལ་སོགས་གཟུགས་བྱས་ལ།
en: “Make an effigy out of beeswax Of the target—those hostile toward the teachings.

source: །དགུག་དང་གཞུགས་སོགས་དབང་དུ་བྱ།
en: Draw him, make him enter, and then take control.

source: ཡིག་འབྲུ་བཅྭ་བརྒྱད་སྔགས་ཀྱིས་ནི། །དུས་གསུམ་བརྡེག་པར་རབ་བྱས་ནས། །འཕྲལ་དུ་ཡིད་ཆེས་འཇོམས་པ་སྟེ།
en: “The eighteen-syllable mantra Forcefully strikes down in the three times, And suddenly his spirit is broken.

source: །བསྒྲུབ་བྱ་གསོད་པར་ཐེ་ཚོམ་མེད།
en: There is no doubt that the target will be slain.

source: །གལ་ཏེ་སྦྱིན་སྲེག་བྱེད་པ་ན། །ཞི་རྒྱས་དབང་དང་མངོན་སྤྱོད་ལས། །འདིར་ནི་དྲག་པོས་བསྒྲལ་བར་བྱ།
en: “If one is practicing the burnt offerings From among peaceful, increasing, magnetizing, and wrathful activities, Here one should perform liberation wrathfully.

source: །ནེར་སྤ་ཚ་ལ་རབ་བསྲེག་བྱ།
en: Thoroughly burn with a blazing fire.
